export type Text = {
  name: string;
  text: string;
};

export const texts: Array<Text> = [
  {
    name: "numbers",
    text: `۹٬۵۶۳٬۶۰۰٬۸۷۱٫۱۴۲
۳۴۵٬۰۰۰٬۹۰۰٬۰۰۰
۹ ۸ ۷ ۶ ۵ ۴ ۳ ۲ ۱ ۰
٠ ١ ٢ ٣ ٤ ٥ ٦ ٧ ٨ ٩
+-÷× ۹*۵ ۲×۵ ۷÷۴ ۸×۷ +۱۰ ۹+۳ ۶-۱ ۲+۷=۹
۴۵۷۲ 4572
٤٥٧٢ 4572

۰۱۰۲۰۳۰۴۰۵۰۶۰۷۰۸۰۹۰۰
۱۱۱۲۱۳۱۴۱۵۱۶۱۷۱۸۱۹۱۰
۲۱۲۲۲۳۲۴۲۵۲۶۲۷۲۸۲۹۲۰
۳۱۳۲۳۳۳۴۳۵۳۶۳۷۳۸۳۹۳۰
۴۱۴۲۴۳۴۴۴۵۴۶۴۷۴۸۴۹۴۰
۵۱۵۲۵۳۵۴۵۵۵۶۵۷۵۸۵۹۵۰
۶۱۶۲۶۳۶۴۶۵۶۶۶۷۶۸۶۹۶۰
۷۱۷۲۷۳۷۴۷۵۷۶۷۷۷۸۷۹۷۰
۸۱۸۲۸۳۸۴۸۵۸۶۸۷۸۸۸۹۸۰
۹۱۹۲۹۳۹۴۹۵۹۶۹۷۹۸۹۹۹۰
٠١٠٢٠٣٠٤٠٥٠٦٠٧٠٨٠٩٠٠
١١١٢١٣١٤١٥١٦١٧١٨١٩١٠
٢١٢٢٢٣٢٤٢٥٢٦٢٧٢٨٢٩٢٠
٣١٣٢٣٣٣٤٣٥٣٦٣٧٣٨٣٩٣٠
٤١٤٢٤٣٤٤٤٥٤٦٤٧٤٨٤٩٤٠
٥١٥٢٥٣٥٤٥٥٥٦٥٧٥٨٥٩٥٠
٦١٦٢٦٣٦٤٦٥٦٦٦٧٦٨٦٩٦٠
٧١٧٢٧٣٧٤٧٥٧٦٧٧٧٨٧٩٧٠
٨١٨٢٨٣٨٤٨٥٨٦٨٧٨٨٨٩٨٠
٩١٩٢٩٣٩٤٩٥٩٦٩٧٩٨٩٩٩٠`,
  },
  {
    name: "persian",
    text: `گنجشک خانگی یا گنجشک معمولی یا گنجشک شهری (نام علمی: Passer domesticus) گونه‌ای گنجشک است که عمدتاً در مناطق شهری و در تعداد بسیار زندگی می‌کند. گنجشک خانگی از آشناترین حیوانات وحشی برای انسان است. زیست‌گاه بومی این پرنده اروپا، سواحل مدیترانه و بیشتر نقاط آسیا است، اما در پی فعالیت‌های انسانی وارد بیشتر نواحی قاره آمریکا، آفریقای جنوب صحرا، نیوزیلند و استرالیا و مناطق شهری در نقاط دیگر دنیا شده‌است. گنجشک خانگی در حال حاضر وسیع‌ترین پراکندگی را در میان تمامی پرندگان وحشی کره زمین دارد. این پرنده در ارتباط تنگاتنگ با سکونت‌گاه‌های انسانی است اما تنها گونهٔ گنجشک نیست که در نزدیکی خانه‌ها زندگی می‌کند.
    گنجشک‌های خانگی در زیستگاه‌ها و اقلیم‌های بسیار متنوعی دیده می‌شوند اما معمولاً بیشتر در نزدیکی سکونتگاه‌های انسانی زندگی کرده و از جنگل‌های انبوه، علفزارها و بیابان‌ها دوری می‌کنند. غذای اصلی این پرنده دانه‌ها و تخم علف‌ها است. البته گنجشک خانگی حیوانی فرصت‌طلب است و از حشرات و بسیاری از غذاهای دیگر هم تغذیه می‌کند. گربه‌ها، قوشها، جغدها ،زاغی‌ها و کلاغها و بسیاری از پرندگان شکاری و پستانداران شکارچی دیگر از دشمنان طبیعی این پرنده کوچک به شمار می‌روند.
    گنجشک‌های خانگی پرندگان بسیار اجتماعی هستند و در تمام فصول سال معمولاً به‌صورت گروهی به جستجو و خوردن غذا مشغول میشوند. همچنین این پرندگان معمولاً به‌صورت گروهی و در نزدیکی یکدیگر لانه‌سازی می‌کنند و درگیر فعالیت‌های اجتماعی مانند بازی در گردخاک و یا حمام آب و آواز می‌شوند. گنجشک‌های خانگی به‌صورت گله‌ای بر روی شاخه های درختان مینشینند و برای تغذیه به پایین می‌آیند. گنجشک خانگی ماده باوجود جثه کوچکش بر گنجشک نر برتری دارد.`,
  },
  {
    name: "arabic",
    text: `العُصفُورُ الدُّوريّ أو اختصارًا الدُّورِيّ، ويُعرف بِالعربيَّة باسمٍ شائعٍ خاطئ هو الدُّوريّ الشَّائع (الاسم العلمي: Passer domesticus) هو طائر ينتمي لِفصيلة العصافير الحقيقية، وهو يتواجد في معظم أجزاء العالم. هذه العصافير طيورٌ صغيرة يبلغ طول الفرد حوالي 16 سم، ووزنه يتراوح بين 39.5 و 24 غراماً. لون الإناث واليوافع بني فاتح ورمادي، ولها علامات سوداء وبيضاء وبنية فاتحة. العُصفور الدوري هو أحد 25 نوعاً من جنس العصافير، وهو يستوطّن معظم أوروبا وحوض البحر الأبيض المتوسط وجزء كبير من آسيا. في العديد من المناطق، هو نوعٌ دخيل سواء كان ذلك الإدخال متعمداً أو عرضياً، ومن البلدان التي أدخل إليها الدوري: أجزاء من أستراليا وأفريقيا والأمريكتين، وبذلك تُعد هذه الطيور إحدى أكثر الأنواع انتشاراً في العالم.
    العُصفُور الدوري نوعٌ ناجحٌ جدًا يُعششُ في ثُقُوبٍ أو في مكانٍ مكشوفٍ في الأشجار في مُستعمراتٍ مُخلخلة،
    وهو يرتبط بالأماكن المأهولة بالبشر، ويمكن أن يعيش في المناطق الحضرية أو الريفية. نظراً لأن موائله ومناخاته منوّعة على نطاق واسع، فإنه يتجنّب الأراضي الخشبية والأراضي العشبية والصحاري البعيدة عن البشر.
    العُصفُور الدوريّ آكل بُذور تكيَّف مع البُذور الكبيرة للأعشاب والحبوب الزراعيَّة، ولكنَّهُ قد يأكل أيضاً اللافقاريات وضُروبًا من الفُتات تتراوح بين الخُبز وألياف اللحم،
    كما تأكل أيضاً الحشرات والعديد من الأغذية الأخرى. أما الحيوانات المفترسة التي تشكل تهديداً لها فتشمل القطط والبيزان والبوم وطائفة واسعة من الثدييات. تختلف نُويعات هذا الطائر في القد وفي تفاصيل الريش. تضع الإناث ما يصل إلى 7 حضنات من البيض في السنة الواحدة في المداريَّات.يرتبط الدوري الشائع كثيراً بالنواحي الثقافية، نظراً لأعدادها وشيوعها وارتباطها بالتجمعات السكانية البشرية. كما يتعرض على نطاقٍ واسع للاضطهاد باعتبارهِ آفة زراعية. ويربى كطائر أليف، ويعتبر عنصراً غذائياً ورمزاً للشهوة والقدرة الجنسية والابتذال. انخفضت أعداد هذه الطيور في بعض المناطق دون غيرها، وبالإجمال فإن النوع ككل ما يزال واسع الوفرة والانتشار في العديد من المناطق. ويُدرجه الاتحاد الدولي لحفظ الطبيعة ضمن قائمة الأنواع غير المهدَّدة في القائمة الحمراء للأنواع المهددة بالانقراض. `,
  },
  {
    name: "urdu",
    text: `گوریا پاسیریڈائی چڑیا خاندان کا ایک پرندہ ہے، جو دنیا کے بیشتر حصوں میں پایا جاتا ہے۔ یہ ایک چھوٹا پرندہ ہے جس کی عام لمبائی 16 سینٹی میٹر (0.52 فٹ) اور بڑے پیمانے پر 24–39.5 گرام (0.85–1.39 oz) ہے۔ مادہ اور جوان پرندے ہلکے بھورے اور سرمئی رنگ کے ہوتے ہیں اور نر کے روشن سیاہ، سفید اور بھورے نشان ہوتے ہیں۔ گھر میں چکر لگانے والی چڑیوں کی نسل کے تقریباً 25 انواع میں سے ایک گوریا ہے، جو زیادہ تر یورپ، بحیرہ روم طاس اور ایشیا کے ایک بڑے حصے میں پایا جاتا ہے۔ آسٹریلیا، افریقہ اور امریکہ کے کچھ حصوں سمیت اس کا جان بوجھ کر یا حادثاتی تعارف؛ اسے سب سے زیادہ تقسیم شدہ جنگلی پرندہ بنا دیتا ہے۔
    گوریا مضبوطی سے انسانی رہائش سے وابستہ ہے اور شہری یا دیہی ماحول میں رہ سکتی ہے۔ اگرچہ وسیع پیمانے پر متنوع رہائش گاہوں اور آب و ہوا میں پایا جاتا ہے، یہ عام طور پر وسیع جنگلات، گھاس کے میدانوں اور صحراؤں کو انسانی ترقی سے دور رکھتا ہے۔ یہ زیادہ تر اناج اور گھاس کے بیجوں کو کھاتی ہے؛ لیکن یہ ایک موقع پرست کھانے والا ہے اور عام طور پر کیڑے مکوڑے اور بہت سی دوسری چیزیں کھاتی ہے۔ اس کے شکاریوں میں گھریلو بلیاں، باز اور بہت سے دوسرے شکاری پرندے اور ممالیہ شامل ہیں۔
    اس کی تعداد، ہر جگہ اور انسانی بستیوں کے ساتھ وابستگی کی وجہ سے گوریا ثقافتی طور پر نمایاں ہے۔ اگرچہ یہ وافر اور وسیع پیمانے پر ہے، لیکن کچھ علاقوں میں اس کی تعداد میں کمی آئی ہے۔ لال فہرست میں اس چڑیا کے تحفظ کی حیثیت؛ کم تشویش ناک نوع کے طور پر درج ہے۔ `,
  },
];
